app/controllers/api/apps_controller.rb

  def index
    render json: App.all.order(created_at: :desc)
---
SELECT "apps".* FROM "apps" ORDER BY "apps"."created_at" DESC

  def create
    app = App.create(app_params)
---
INSERT INTO "apps" ("name", "description", "category", "price", "version", "author", "logo", "featured", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def update
    if @app.update(app_params)
---
UPDATE "apps" SET "price" = $1, "author" = $2, "updated_at" = $3 WHERE "apps"."id" = $4  [["price", 90.0], ["author", "Ian"], ["updated_at", "2018-03-14 20:12:12.042388"], ["id", 82]]

    def set_app
      @app = App.find(params[:id])
---
SELECT  "apps".* FROM "apps" WHERE "apps"."id" = $1 LIMIT $2  [["id", 82], ["LIMIT", 1]]